package yugo;

public class TelegramBotContent {

    public static final String STEP_1_TEXT = """
            *ВІТАЄМО НА ПЕРШОМУ РІВНІ!*
                                                                  
            Ти прокидаєшся і розумієш, що ти — кіт. Ранок добрий, але що це за дивні відчуття? Твій живіт бурчить від шаленого голоду. Їжі на столі немає, хіба що в закритому новітньому холодильнику. Що ж робити?
            
            Доведеться навчитися, як хакати цифровий холодильник. Відкриваємо сайт "Просунутий хакінг для Котів":
            
                1. Виконай перше завдання, та йди далі!
                2. Прокачайся та переходь до найцікавішого!
                3. Вчини діяння, щоб заслужити повагу серед усіх місцевих котів!
            
            *Кіт домашній звичайніус - рівень I.*
            Зламай цифровий холодильник і виконаєшь перше завдання, за це ти заробишь 10 €!
            """;

    public static final String STEP_2_TEXT = """
            *ВІТАЄМО НА ДРУГОМУ РІВНІ!*
                                  
            Юху! Ти здолав холодильник. За це отримуєш +10 €!
            
            _Накопичено: 10 €._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_3_TEXT = """
            *Кіт Айтішнік - рівень II.*
            Несподівано, з-за кута виповз дзижчащий робот-пилосос. Настав час помсти!
            Виконай друге завдання та хакни його!
            """;

    public static final String STEP_4_TEXT = """
            *ВІТАЄМО НА ТРЕТЬОМУ РІВНІ!*
                                    
            Ти здолав робопилосос! Ти отримуєш +20 €!
                                      
            _Накопичено: 30 €._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_5_TEXT = """
            *Кіт Робопідкорювач - рівень III.*
            Хо-хо! На шафі виявлений нічийний GoPro!
            Виконай третє завдання — одягни та включи його!
            """;

    public static final String STEP_6_TEXT = """
            *ВІТАЄМО НА ЧЕТВЕРТОМУ РІВНІ!*
                                    
            Ти одягнув GoPro! Ти отримуєш +30 €!
                                    
            _Накопичено: 60 €._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_7_TEXT = """
            *Кіт Відеоблогер - рівень IV.*
            Тепер знятий матеріал треба залити на комп'ютер.
            Виконай четверте завдання — зламай пароль від комп'ютера!
            """;

    public static final String STEP_8_TEXT = """
            *ВІТАЄМО НА П'ЯТОМУ РІВНІ!*
            
            Ти здолав комп'ютер! Ти отримуєш +40 €!
            
            _Не поганий день! За сьогодні заробив: 100 €._
            """;

    public static final String FINAL_TEXT = """
            *Тепер ти Кіт Хакер - V level.*
            День минув не даремно: кіт-хакер вчинив свої діяння та заслужив повагу серед місцевих дворових котів.
            """;
}
